## PAIR PROGRAMMING LIMPIEZA I
---

In [15]:
import pandas as pd
import numpy as np

En este ejercicio trabajaremos con el dataframe que nos guardamos en la sesión de pair de Pandas VII.

Antes de seguir, recordamos las preguntas que nos planteamos al principio del pair programming de EDA para dirigir nuestro análisis.

- ¿Es Australia es el sitio más peligroso y letal para estar relajada en la playa?
- ¿Cuál es el rango de edad que sufre la mayoría de los ataques?
- Independientemente de la edad, sufren los hombres más ataques que las mujeres?
- ¿En qué mes ocurren más ataques?
- ¿Cuál es la relación entre la especie y el tipo de ataque (si es fatal o no)?
- ¿Cómo han evolucionado los ataques a lo largo del tiempo?
- De todo esto, nos damos cuenta que solo tenemos que limpiar algunas de las columnas, en concreto age, species, country, fatal, year, sex. Si reducimos esto a una tabla para saber que tenemos ya limpito y que no (mirar en Gitbook)

**EJERCICIO 1**

Entre las tareas que tendréis que hacer hoy:

- Al empezar a trabajar con este dataframe ya eliminamos algunas columnas que a priori no nos interesaban. Ahora llega el momento de eliminar alguna columna más. En este caso tendréis que eliminar las columnas que no nos sean útiles para contestar a nuestras preguntas. Pero ojo ⚠️, haced una copia del dataframe para no "cargarnos" el dataframe original y perder la info.

In [5]:
df = pd.read_csv('../files/attacks7.csv', index_col=0)
df.head(2)

,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,href,fatal_(y/n),injury,date,mes_ataque,fatal,sexo
0,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,Y,"FATAL, all onboard were killed by sharks",1800,NaN,Y,F
1,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,Y,FATAL,Reported May-28-1797,May,Y,NaN

In [6]:
# Hacemos una copia del DataFrame original 
df2=df.copy()
df2.head(2)

,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,href,fatal_(y/n),injury,date,mes_ataque,fatal,sexo
0,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,Y,"FATAL, all onboard were killed by sharks",1800,NaN,Y,F
1,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,Y,FATAL,Reported May-28-1797,May,Y,NaN

In [7]:
# Borramos las columnas que consideramos innecesarias para responder a las preguntas y las que están categorizadas y limpias en otras columnas.
df2.drop(['area', 'location', 'name', 'time', 'href', 'fatal_(y/n)', 'injury', 'sex_'], axis=1, inplace=True)
df2.head()

,case_number,year,type,country,activity,age,species_,date,mes_ataque,fatal,sexo
0,1800.00.00,1800.0,Unprovoked,SEYCHELLES,a corsair's boat was overturned,NaN,NaN,1800,NaN,Y,F
1,1797.05.28.R,1797.0,Unprovoked,NaN,Dropped overboard,NaN,NaN,Reported May-28-1797,May,Y,NaN
2,1792.09.12,1792.0,Provoked,ENGLAND,Fishing,NaN,NaN,12-Sep-1792,Sep,Y,M
3,1791.00.00,1791.0,Unprovoked,AUSTRALIA,NaN,NaN,NaN,1791,NaN,Y,F
4,1788.05.10,1788.0,Boat,AUSTRALIA,Fishing,NaN,NaN,10-May-1788,May,N,NaN

---

**EJERCICIO 2**

- ¿Hay valores duplicados en nuestro dataframe? En caso de que los haya, eliminándlos.

In [8]:
df2.duplicated().sum() # No hay valores duplicados que eliminar

0

---

**EJERCICIO 3**

- Como hemos visto, algunas columnas no tienen el tipo de datos que deberían. Cambiad el tipo de dato para la columna de year.

In [9]:
df2.year.dtype

dtype('float64')

In [10]:
# La columna 'year' es de tipo float64 y la cambiamos a int64 con el método .astype()
df2['year']= df2['year'].astype('int64', errors= 'ignore')

In [11]:
df2.year.dtype

dtype('int64')

---

**EJERCICIO 4**

- En la columna de country poner todos los valores en minúsculas.
💡 Pista Tendréis que usar una función o una lambda 💡

In [18]:
def minuscula(col):
    
        '''Convertimos los datos de la columna en minúscula
            parámetro = columna seleccionada
            return = los datos en minuscula o NaN '''

        try:
            return col.lower()
        except:   
            return np.nan

In [19]:
# Aplicamos la función a la columna 'country' y lo comprobamos
df2['country'] =df2['country'].apply(minuscula)
df2.head()

,case_number,year,type,country,activity,age,species_,date,mes_ataque,fatal,sexo
0,1800.00.00,1800,Unprovoked,seychelles,a corsair's boat was overturned,NaN,NaN,1800,NaN,Y,F
1,1797.05.28.R,1797,Unprovoked,NaN,Dropped overboard,NaN,NaN,Reported May-28-1797,May,Y,NaN
2,1792.09.12,1792,Provoked,england,Fishing,NaN,NaN,12-Sep-1792,Sep,Y,M
3,1791.00.00,1791,Unprovoked,australia,NaN,NaN,NaN,1791,NaN,Y,F
4,1788.05.10,1788,Boat,australia,Fishing,NaN,NaN,10-May-1788,May,N,NaN

---

**EJERCICIO 5**

- Guardamos el csv para seguir trabajando en el siguiente ejercicio de pair de limpieza.

In [ ]:
df2.to_pickle('../files/attacks8.pkl') # Lo guardamos en formato pickle para que nos conserve los cambios en el tipo de columna.